{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "[UNK]": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "&": 7,
      "'": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "<": 29,
      "=": 30,
      ">": 31,
      "?": 32,
      "@": 33,
      "A": 34,
      "B": 35,
      "C": 36,
      "D": 37,
      "E": 38,
      "F": 39,
      "G": 40,
      "H": 41,
      "I": 42,
      "J": 43,
      "K": 44,
      "L": 45,
      "M": 46,
      "N": 47,
      "O": 48,
      "P": 49,
      "Q": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "Z": 59,
      "[": 60,
      "\\": 61,
      "]": 62,
      "^": 63,
      "_": 64,
      "`": 65,
      "a": 66,
      "b": 67,
      "c": 68,
      "d": 69,
      "e": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "i": 74,
      "j": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "q": 82,
      "r": 83,
      "s": 84,
      "t": 85,
      "u": 86,
      "v": 87,
      "w": 88,
      "x": 89,
      "y": 90,
      "z": 91,
      "{": 92,
      "|": 93,
      "}": 94,
      "~": 95,
      "π": 96,
      "�": 97,
      "ra": 98,
      "rac": 99,
      "frac": 100,
      "ma": 101,
      "ta": 102,
      "ig": 103,
      "ar": 104,
      "al": 105,
      "le": 106,
      "th": 107,
      "ft": 108,
      "igh": 109,
      "in": 110,
      "righ": 111,
      "me": 112,
      "ph": 113,
      "math": 114,
      "left": 115,
      "right": 116,
      "am": 117,
      "eta": 118,
      "\\,": 119,
      "ti": 120,
      "mu": 121,
      "si": 122,
      "de": 123,
      "rm": 124,
      "mathrm": 125,
      "pha": 126,
      "pr": 127,
      "alpha": 128,
      "da": 129,
      "par": 130,
      "tial": 131,
      "partial": 132,
      "ot": 133,
      "pi": 134,
      "psi": 135,
      "ime": 136,
      "prime": 137,
      "lta": 138,
      "dot": 139,
      "phi": 140,
      "bda": 141,
      "ambda": 142,
      "amma": 143,
      "nu": 144,
      "\\;": 145,
      "ray": 146,
      "array": 147,
      "bf": 148,
      "cal": 149,
      "bar": 150,
      "igma": 151,
      "ve": 152,
      "int": 153,
      "lambda": 154,
      "qu": 155,
      "rt": 156,
      "lo": 157,
      "ng": 158,
      "beta": 159,
      "delta": 160,
      "\\\\": 161,
      "theta": 162,
      "ngle": 163,
      "gamma": 164,
      "sq": 165,
      "sqrt": 166,
      "ga": 167,
      "mega": 168,
      "sigma": 169,
      "lon": 170,
      "su": 171,
      "psilon": 172,
      "at": 173,
      "epsilon": 174,
      "hat": 175,
      "sum": 176,
      "hi": 177,
      "ad": 178,
      "quad": 179,
      "ho": 180,
      "rho": 181,
      "cdot": 182,
      "lde": 183,
      "tilde": 184,
      "mathbf": 185,
      "la": 186,
      "to": 187,
      "var": 188,
      "be": 189,
      "nd": 190,
      "end": 191,
      "gin": 192,
      "begin": 193,
      "omega": 194,
      "tau": 195,
      "na": 196,
      "vec": 197,
      "rangle": 198,
      "\\{": 199,
      "fty": 200,
      "infty": 201,
      "Gamma": 202,
      "De": 203,
      "Delta": 204,
      "pe": 205,
      "xi": 206,
      "ow": 207,
      "\\}": 208,
      "tar": 209,
      "lin": 210,
      "line": 211,
      "row": 212,
      "ge": 213,
      "rline": 214,
      "Phi": 215,
      "ap": 216,
      "tarrow": 217,
      "varphi": 218,
      "ope": 219,
      "rna": 220,
      "rato": 221,
      "operato": 222,
      "rname": 223,
      "operatorname": 224,
      "pm": 225,
      "mes": 226,
      "times": 227,
      "langle": 228,
      "Lambda": 229,
      "ove": 230,
      "sin": 231,
      "co": 232,
      "rightarrow": 233,
      "dots": 234,
      "overline": 235,
      "chi": 236,
      "\\!": 237,
      "cos": 238,
      "big": 239,
      "st": 240,
      "pa": 241,
      "ex": 242,
      "iv": 243,
      "qquad": 244,
      "equ": 245,
      "equiv": 246,
      "Omega": 247,
      "kap": 248,
      "pro": 249,
      "kappa": 250,
      "ll": 251,
      "dag": 252,
      "Big": 253,
      "ln": 254,
      "Psi": 255,
      "varepsilon": 256,
      "cdots": 257,
      "mathcal": 258,
      "ger": 259,
      "dagger": 260,
      "yle": 261,
      "style": 262,
      "ldots": 263,
      "bo": 264,
      "bol": 265,
      "bla": 266,
      "nabla": 267,
      "ell": 268,
      "exp": 269,
      "zeta": 270,
      "wi": 271,
      "wide": 272,
      "Sigma": 273,
      "sim": 274,
      "leq": 275,
      "\\:": 276,
      "bigg": 277,
      "otimes": 278,
      "hbar": 279,
      "Pi": 280,
      "mi": 281,
      "mathb": 282,
      "mathbb": 283,
      "bold": 284,
      "prox": 285,
      "approx": 286,
      "vert": 287,
      "mid": 288,
      "sp": 289,
      "prod": 290,
      "log": 291,
      "di": 292,
      "widetilde": 293,
      "we": 294,
      "dge": 295,
      "wedge": 296,
      "per": 297,
      "perp": 298,
      "ystyle": 299,
      "laystyle": 300,
      "splaystyle": 301,
      "displaystyle": 302,
      "tstyle": 303,
      "un": 304,
      "unde": 305,
      "meq": 306,
      "simeq": 307,
      "ri": 308,
      "Th": 309,
      "Theta": 310,
      "tex": 311,
      "underline": 312,
      "sy": 313,
      "sym": 314,
      "symbol": 315,
      "boldsymbol": 316,
      "geq": 317,
      "\\|": 318,
      "ck": 319,
      "sc": 320,
      "eq": 321,
      "ast": 322,
      "se": 323,
      "widehat": 324,
      "rip": 325,
      "scrip": 326,
      "re": 327,
      "tan": 328,
      "rc": 329,
      "set": 330,
      "ci": 331,
      "circ": 332,
      "rel": 333,
      "sta": 334,
      "stack": 335,
      "stackrel": 336,
      "sinh": 337,
      "neq": 338,
      "cosh": 339,
      "star": 340,
      "op": 341,
      "scriptstyle": 342,
      "us": 343,
      "textstyle": 344,
      "mp": 345,
      "Bigg": 346,
      "not": 347,
      "vartheta": 348,
      "Bigr": 349,
      "Bigl": 350,
      "biggr": 351,
      "biggl": 352,
      "boldmath": 353,
      "lus": 354,
      "oplus": 355,
      "ngrightarrow": 356,
      "fo": 357,
      "brac": 358,
      "text": 359,
      "fra": 360,
      "mathfra": 361,
      "mathfrak": 362,
      "sf": 363,
      "longrightarrow": 364,
      "rall": 365,
      "forall": 366,
      "sub": 367,
      "subset": 368,
      "bigl": 369,
      "bigr": 370,
      "pto": 371,
      "propto": 372,
      "oint": 373,
      "parrow": 374,
      "uparrow": 375,
      "lle": 376,
      "ps": 377,
      "maps": 378,
      "mapsto": 379,
      "ddot": 380,
      "angle": 381,
      "om": 382,
      "leftrightarrow": 383,
      "no": 384,
      "cu": 385,
      "bin": 386,
      "binom": 387,
      "vdots": 388,
      "Xi": 389,
      "tri": 390,
      "triangle": 391,
      "rbrac": 392,
      "mbe": 393,
      "numbe": 394,
      "nonumbe": 395,
      "nonumber": 396,
      "mathsf": 397,
      "cup": 398,
      "bot": 399,
      "or": 400,
      "arc": 401,
      "it": 402,
      "Righ": 403,
      "Rightarrow": 404,
      "flo": 405,
      "floor": 406,
      "over": 407,
      "cot": 408,
      "ce": 409,
      "cong": 410,
      "cap": 411,
      "textrm": 412,
      "--": 413,
      "rbrace": 414,
      "ralle": 415,
      "paralle": 416,
      "parallel": 417,
      "ne": 418,
      "imath": 419,
      "varrho": 420,
      "tscriptstyle": 421,
      "scriptscriptstyle": 422,
      "lbrac": 423,
      "he": 424,
      "sh": 425,
      "arctan": 426,
      "che": 427,
      "check": 428,
      "own": 429,
      "arrow": 430,
      "down": 431,
      "cfrac": 432,
      "bu": 433,
      "textbf": 434,
      "subseteq": 435,
      "nto": 436,
      "phanto": 437,
      "phantom": 438,
      "downarrow": 439,
      "od": 440,
      "sla": 441,
      "io": 442,
      "iota": 443,
      "gg": 444,
      "land": 445,
      "llet": 446,
      "bullet": 447,
      "overrightarrow": 448,
      "ddots": 449,
      "Biggl": 450,
      "tin": 451,
      "tiny": 452,
      "Biggr": 453,
      "Upsilon": 454,
      "lbrack": 455,
      "rfloor": 456,
      "exi": 457,
      "sts": 458,
      "exists": 459,
      "colon": 460,
      "inus": 461,
      "Im": 462,
      "underbrace": 463,
      "slash": 464,
      "lfloor": 465,
      "jmath": 466,
      "vee": 467,
      "ftarrow": 468,
      "Re": 469,
      "atop": 470,
      "Ve": 471,
      "Lo": 472,
      "mathit": 473,
      "neg": 474,
      "leftarrow": 475,
      "wp": 476,
      "Vert": 477,
      "sma": 478,
      "minus": 479,
      "setminus": 480,
      "small": 481,
      "dim": 482,
      "iint": 483,
      "sup": 484,
      "bigoplus": 485,
      "bigcup": 486,
      "il": 487,
      "supset": 488,
      "ngleftrightarrow": 489,
      "coth": 490,
      "ke": 491,
      "lor": 492,
      "mod": 493,
      "sec": 494,
      "Le": 495,
      "pmod": 496,
      "ftrightarrow": 497,
      "Leftrightarrow": 498,
      "hline": 499,
      "rbrack": 500,
      "upsilon": 501,
      "bmod": 502,
      "\\#": 503,
      "arge": 504,
      "eph": 505,
      "aleph": 506,
      "mit": 507,
      "Longrightarrow": 508,
      "bre": 509,
      "odot": 510,
      "bigwedge": 511,
      "lbrace": 512,
      "breve": 513,
      "arcsin": 514,
      "ker": 515,
      "arp": 516,
      "csc": 517,
      "ze": 518,
      "size": 519,
      "->": 520,
      "overset": 521,
      "lap": 522,
      "varpi": 523,
      "emp": 524,
      "ty": 525,
      "empty": 526,
      "emptyset": 527,
      "otnot": 528,
      "footnot": 529,
      "footnote": 530,
      "li": 531,
      "footnotesize": 532,
      "te": 533,
      "textsf": 534,
      "acu": 535,
      "acute": 536,
      "ff": 537,
      "iff": 538,
      "nt": 539,
      "sb": 540,
      "up": 541,
      "longleftrightarrow": 542,
      "arg": 543,
      "dash": 544,
      "lnot": 545,
      "deg": 546,
      "under": 547,
      "bigtriangle": 548,
      "underset": 549,
      "oo": 550,
      "arpoo": 551,
      "slant": 552,
      "Bo": 553,
      "tt": 554,
      "vphantom": 555,
      "Box": 556,
      "tharpoo": 557,
      "rlap": 558,
      "iiint": 559,
      "varsigma": 560,
      "Longleftrightarrow": 561,
      "es": 562,
      "imp": 563,
      "lies": 564,
      "implies": 565,
      "hf": 566,
      "Large": 567,
      "ack": 568,
      "back": 569,
      "backslash": 570,
      "lce": 571,
      "lceil": 572,
      "eil": 573,
      "rceil": 574,
      "large": 575,
      "mathop": 576,
      "rightharpoo": 577,
      "vdash": 578,
      "top": 579,
      "bigcap": 580,
      "xrightarrow": 581,
      "ec": 582,
      "nup": 583,
      "rightharpoonup": 584,
      "ill": 585,
      "overbrace": 586,
      "bigotimes": 587,
      "\\^": 588,
      "ru": 589,
      "doteq": 590,
      "stru": 591,
      "kern": 592,
      "hfill": 593,
      "strut": 594,
      "bigtriangleup": 595,
      "leqslant": 596,
      "overleftarrow": 597,
      "ip": 598,
      "kip": 599,
      "skip": 600,
      "ominus": 601,
      "ond": 602,
      "amond": 603,
      "triangleq": 604,
      "ddagger": 605,
      "cdotp": 606,
      "box": 607,
      "null": 608,
      "thin": 609,
      "prot": 610,
      "varno": 611,
      "thing": 612,
      "protec": 613,
      "varnothing": 614,
      "protect": 615,
      "ni": 616,
      "bigstar": 617,
      "diamond": 618,
      "div": 619,
      "\\/": 620,
      "sharp": 621,
      "fl": 622,
      "flat": 623,
      "notin": 624,
      "llap": 625,
      "rVert": 626,
      "long": 627,
      "varDelta": 628,
      "longmapsto": 629,
      "lVert": 630,
      "dotsc": 631,
      "``": 632,
      "krightarrow": 633,
      "okrightarrow": 634,
      "hookrightarrow": 635,
      "make": 636,
      "bigtriangledown": 637,
      "makebox": 638,
      "ref": 639,
      "Vdash": 640,
      "supseteq": 641,
      "bigvee": 642,
      "subsetneq": 643,
      "en": 644,
      "geqslant": 645,
      "sl": 646,
      "dotsb": 647,
      "lim": 648,
      "enskip": 649,
      "textup": 650,
      "triangleleft": 651,
      "mal": 652,
      "sqcup": 653,
      "rmal": 654,
      "normal": 655,
      "mo": 656,
      "mode": 657,
      "jlim": 658,
      "ls": 659,
      "ou": 660,
      "spa": 661,
      "vline": 662,
      "models": 663,
      "space": 664,
      "drel": 665,
      "er": 666,
      "rd": 667,
      "surd": 668,
      "labe": 669,
      "buil": 670,
      "label": 671,
      "buildrel": 672,
      "ise": 673,
      "raise": 674,
      "\\-": 675,
      "pou": 676,
      "nds": 677,
      "pounds": 678,
      "\\&": 679,
      "squ": 680,
      "---": 681,
      "Vec": 682,
      "ns": 683,
      "are": 684,
      "square": 685,
      "ftharpoo": 686,
      "leftharpoo": 687,
      "mathrel": 688,
      "rightleftharpoo": 689,
      "varOmega": 690,
      "smallsetminus": 691,
      "hfil": 692,
      "rightleftharpoons": 693,
      "fbox": 694,
      "smi": 695,
      "mathor": 696,
      "searrow": 697,
      "smile": 698,
      "mathord": 699,
      "cc": 700,
      "ngleftarrow": 701,
      "succ": 702,
      "smallskip": 703,
      "lg": 704,
      "\\*": 705,
      "oslash": 706,
      "rtimes": 707,
      "tit": 708,
      "prec": 709,
      "textit": 710,
      "texttt": 711,
      "bigm": 712,
      "triangleright": 713,
      "normalsize": 714,
      "ss": 715,
      "inter": 716,
      "longleftarrow": 717,
      "intercal": 718,
      "Down": 719,
      "frow": 720,
      "ral": 721,
      "nearrow": 722,
      "Downarrow": 723,
      "frown": 724,
      "mpe": 725,
      "nat": 726,
      "ural": 727,
      "varpro": 728,
      "bumpe": 729,
      "natural": 730,
      "varprojlim": 731,
      "bumpeq": 732,
      "SS": 733,
      "ere": 734,
      "ohe": 735,
      "tw": 736,
      "leme": 737,
      "there": 738,
      "injlim": 739,
      "adrightarrow": 740,
      "varinjlim": 741,
      "comp": 742,
      "fore": 743,
      "overleftrightarrow": 744,
      "oheadrightarrow": 745,
      "twoheadrightarrow": 746,
      "lement": 747,
      "therefore": 748,
      "complement": 749,
      "ca": 750,
      "thi": 751,
      "nce": 752,
      "ign": 753,
      "align": 754,
      "mathstrut": 755,
      "suit": 756,
      "bigcirc": 757,
      "diamondsuit": 758,
      "cance": 759,
      "thick": 760,
      "cancel": 761,
      "Uparrow": 762,
      "dskip": 763,
      "hphantom": 764,
      "medskip": 765,
      "AR": 766,
      "GE": 767,
      "LAR": 768,
      "bow": 769,
      "gt": 770,
      "ro": 771,
      "less": 772,
      "mathtt": 773,
      "tie": 774,
      "bigsqcup": 775,
      "Biggm": 776,
      "thicksim": 777,
      "LARGE": 778,
      "bowtie": 779,
      "lesssim": 780,
      "llde": 781,
      "warrow": 782,
      "nullde": 783,
      "noalign": 784,
      "smash": 785,
      "miter": 786,
      "limiter": 787,
      "nulldelimiter": 788,
      "nulldelimiterspace": 789,
      "AA": 790,
      "Da": 791,
      "vDa": 792,
      "barwedge": 793,
      "beth": 794,
      "eqno": 795,
      "roup": 796,
      "vDash": 797,
      "5in": 798,
      "Di": 799,
      "ts": 800,
      "ndown": 801,
      "gets": 802,
      "coprod": 803,
      "dotsm": 804,
      "textnormal": 805,
      "rightharpoondown": 806,
      "Diamond": 807,
      "mm": 808,
      "nrightarrow": 809,
      "nleftrightarrow": 810,
      "rsim": 811,
      "rne": 812,
      "swarrow": 813,
      "mathc": 814,
      "sqcap": 815,
      "lax": 816,
      "corne": 817,
      "Bigm": 818,
      "relax": 819,
      "preceq": 820,
      "gtrsim": 821,
      "corner": 822,
      "mathope": 823,
      "lose": 824,
      "varkappa": 825,
      "cite": 826,
      "mathclose": 827,
      "mathopen": 828,
      ")=": 829,
      "Bar": 830,
      "Ti": 831,
      "asym": 832,
      "do": 833,
      "gra": 834,
      "lr": 835,
      "lse": 836,
      "uge": 837,
      "xleftarrow": 838,
      "mathnormal": 839,
      "rightrightarrow": 840,
      "rightleftarrow": 841,
      "lowe": 842,
      "sqsubseteq": 843,
      "colse": 844,
      "succeq": 845,
      "Tilde": 846,
      "asymp": 847,
      "grave": 848,
      "lrcorner": 849,
      "rightrightarrows": 850,
      "rightleftarrows": 851,
      "lower": 852,
      "colsep": 853,
      "Hat": 854,
      "ak": 855,
      "ble": 856,
      "dou": 857,
      "group": 858,
      "nright": 859,
      "nleftarrow": 860,
      "rk": 861,
      "rgroup": 862,
      "uph": 863,
      "wbre": 864,
      "allo": 865,
      "side": 866,
      "hom": 867,
      "bigodot": 868,
      "arpoonright": 869,
      "lgroup": 870,
      "blebarwedge": 871,
      "doublebarwedge": 872,
      "upharpoonright": 873,
      "wbreak": 874,
      "allowbreak": 875,
      "sideset": 876,
      "Huge": 877,
      "amal": 878,
      "cm": 879,
      "hskip": 880,
      "lq": 881,
      "pprox": 882,
      "ske": 883,
      "rapprox": 884,
      "arraycolsep": 885,
      "ver": 886,
      "sure": 887,
      "varlim": 888,
      "pmb": 889,
      "substack": 890,
      "leftrightarrows": 891,
      "Longleftarrow": 892,
      "supsetneq": 893,
      "updownarrow": 894,
      "ensure": 895,
      "gtrapprox": 896,
      "amalg": 897,
      "skew": 898,
      "ensuremath": 899,
      "ch": 900,
      "crc": 901,
      "dig": 902,
      "ddag": 903,
      "em": 904,
      "gime": 905,
      "jo": 906,
      "ltimes": 907,
      "nleq": 908,
      "nwarrow": 909,
      "tch": 910,
      "mark": 911,
      "tag": 912,
      "led": 913,
      "thde": 914,
      "inrel": 915,
      "lefteq": 916,
      "coun": 917,
      "withde": 918,
      "mathbin": 919,
      "setcoun": 920,
      "circled": 921,
      "ointop": 922,
      "notag": 923,
      "smallint": 924,
      "footnotemark": 925,
      "ter": 926,
      "ooalign": 927,
      "protectu": 928,
      "lims": 929,
      "verb": 930,
      "crcr": 931,
      "digamma": 932,
      "gimel": 933,
      "joinrel": 934,
      "lefteqn": 935,
      "withdelims": 936,
      "setcounter": 937,
      "1p": 938,
      "Ar": 939,
      "Rrightarrow": 940,
      "\\'": 941,
      "ae": 942,
      "ag": 943,
      "ape": 944,
      "bcolsep": 945,
      "fill": 946,
      "huge": 947,
      "mkern": 948,
      "mskip": 949,
      "wline": 950,
      "tabcolsep": 951,
      "inf": 952,
      "inde": 953,
      "pitch": 954,
      "dotsi": 955,
      "intop": 956,
      "rowvert": 957,
      "rightarrowfill": 958,
      "llcorner": 959,
      "black": 960,
      "leqq": 961,
      "biggm": 962,
      "approxeq": 963,
      "diag": 964,
      "scsh": 965,
      "fork": 966,
      "brace": 967,
      "textsc": 968,
      "textsl": 969,
      "textcircled": 970,
      "cur": 971,
      "newline": 972,
      "atopwithdelims": 973,
      "negthick": 974,
      "Leftarrow": 975,
      "uplus": 976,
      "subsetneqq": 977,
      "varlimsup": 978,
      "varliminf": 979,
      "1pt": 980,
      "Arrowvert": 981,
      "pitchfork": 982,
      "blacksquare": 983,
      "diagup": 984,
      "scshape": 985,
      "negthickspace": 986,
      ")}": 987,
      "1mm": 988,
      "1cm": 989,
      "20": 990,
      "2in": 991,
      "3mm": 992,
      "5cm": 993,
      "6cm": 994,
      "7mm": 995,
      "8cm": 996,
      "DK": 997,
      "Tr": 998,
      "ac": 999,
      "ave": 1000,
      "ckap": 1001,
      "dddot": 1002,
      "ed": 1003,
      "erline": 1004,
      "ever": 1005,
      "ij": 1006,
      "ice": 1007,
      "ly": 1008,
      "md": 1009,
      "nda": 1010,
      "nnu": 1011,
      "nmid": 1012,
      "nRightarrow": 1013,
      "nVdash": 1014,
      "of": 1015,
      "off": 1016,
      "sho": 1017,
      "spe": 1018,
      "vmode": 1019,
      "wr": 1020,
      "ymath": 1021,
      "{\\": 1022,
      "}+": 1023,
      "mannu": 1024,
      "igarrow": 1025,
      "leave": 1026,
      "fter": 1027,
      "meral": 1028,
      "mathac": 1029,
      "leftrightharpoo": 1030,
      "rightsqu": 1031,
      "def": 1032,
      "parbox": 1033,
      "\\;}": 1034,
      "arrayst": 1035,
      "vearrow": 1036,
      "interline": 1037,
      "rtmid": 1038,
      "ngeq": 1039,
      "hoice": 1040,
      "varGamma": 1041,
      "varpropto": 1042,
      "vartriangle": 1043,
      "varUpsilon": 1044,
      "biguplus": 1045,
      "panda": 1046,
      "expanda": 1047,
      "perca": 1048,
      "retch": 1049,
      "cial": 1050,
      "notk": 1051,
      "brack": 1052,
      "textmd": 1053,
      "noinde": 1054,
      "overwithdelims": 1055,
      "cent": 1056,
      "owns": 1057,
      "veebar": 1058,
      "upperca": 1059,
      "underbar": 1060,
      "underrightarrow": 1061,
      "backsimeq": 1062,
      "boxtimes": 1063,
      "boxed": 1064,
      "protecte": 1065,
      "protectE": 1066,
      "protectZ": 1067,
      "protectm": 1068,
      "trianglelefteq": 1069,
      "preccur": 1070,
      "thickap": 1071,
      "root": 1072,
      "romannu": 1073,
      "mathchoice": 1074,
      "emph": 1075,
      "circledcirc": 1076,
      "index": 1077,
      "curvearrow": 1078,
      ")}}": 1079,
      "everymath": 1080,
      "lyeq": 1081,
      "offinterline": 1082,
      "shortmid": 1083,
      "special": 1084,
      "leavevmode": 1085,
      "mathaccent": 1086,
      "leftrightharpoons": 1087,
      "rightsquigarrow": 1088,
      "arraystretch": 1089,
      "expandafter": 1090,
      "noindent": 1091,
      "uppercase": 1092,
      "preccurlyeq": 1093,
      "thickapprox": 1094,
      "romannumeral": 1095,
      "curvearrowright": 1096,
      "offinterlineskip": 1097
    },
    "merges": [
      "r a",
      "ra c",
      "f rac",
      "m a",
      "t a",
      "i g",
      "a r",
      "a l",
      "l e",
      "t h",
      "f t",
      "ig h",
      "i n",
      "r igh",
      "m e",
      "p h",
      "ma th",
      "le ft",
      "righ t",
      "a m",
      "e ta",
      "\\ ,",
      "t i",
      "m u",
      "s i",
      "d e",
      "r m",
      "math rm",
      "ph a",
      "p r",
      "al pha",
      "d a",
      "p ar",
      "ti al",
      "par tial",
      "o t",
      "p i",
      "p si",
      "i me",
      "pr ime",
      "l ta",
      "d ot",
      "ph i",
      "b da",
      "am bda",
      "am ma",
      "n u",
      "\\ ;",
      "ra y",
      "ar ray",
      "b f",
      "c al",
      "b ar",
      "ig ma",
      "v e",
      "in t",
      "l ambda",
      "q u",
      "r t",
      "l o",
      "n g",
      "b eta",
      "de lta",
      "\\ \\",
      "th eta",
      "ng le",
      "g amma",
      "s q",
      "sq rt",
      "g a",
      "me ga",
      "s igma",
      "lo n",
      "s u",
      "psi lon",
      "a t",
      "e psilon",
      "h at",
      "su m",
      "h i",
      "a d",
      "qu ad",
      "h o",
      "r ho",
      "c dot",
      "l de",
      "ti lde",
      "math bf",
      "l a",
      "t o",
      "v ar",
      "b e",
      "n d",
      "e nd",
      "g in",
      "be gin",
      "o mega",
      "ta u",
      "n a",
      "ve c",
      "ra ngle",
      "\\ {",
      "ft y",
      "in fty",
      "G amma",
      "D e",
      "De lta",
      "p e",
      "x i",
      "o w",
      "\\ }",
      "ta r",
      "l in",
      "lin e",
      "r ow",
      "g e",
      "r line",
      "P hi",
      "a p",
      "tar row",
      "var phi",
      "o pe",
      "r na",
      "ra to",
      "ope rato",
      "rna me",
      "operato rname",
      "p m",
      "me s",
      "ti mes",
      "la ngle",
      "L ambda",
      "o ve",
      "s in",
      "c o",
      "righ tarrow",
      "dot s",
      "ove rline",
      "c hi",
      "\\ !",
      "co s",
      "b ig",
      "s t",
      "p a",
      "e x",
      "i v",
      "q quad",
      "e qu",
      "equ iv",
      "O mega",
      "k ap",
      "pr o",
      "kap pa",
      "l l",
      "da g",
      "B ig",
      "l n",
      "P si",
      "var epsilon",
      "cdot s",
      "math cal",
      "ge r",
      "dag ger",
      "y le",
      "st yle",
      "l dots",
      "b o",
      "bo l",
      "b la",
      "na bla",
      "e ll",
      "ex p",
      "z eta",
      "w i",
      "wi de",
      "S igma",
      "si m",
      "le q",
      "\\ :",
      "big g",
      "o times",
      "h bar",
      "P i",
      "m i",
      "math b",
      "mathb b",
      "bol d",
      "pro x",
      "ap prox",
      "ve rt",
      "mi d",
      "s p",
      "pro d",
      "lo g",
      "d i",
      "wide tilde",
      "w e",
      "d ge",
      "we dge",
      "pe r",
      "per p",
      "y style",
      "la ystyle",
      "sp laystyle",
      "di splaystyle",
      "t style",
      "u n",
      "un de",
      "me q",
      "si meq",
      "r i",
      "T h",
      "Th eta",
      "t ex",
      "unde rline",
      "s y",
      "sy m",
      "sym bol",
      "bold symbol",
      "ge q",
      "\\ |",
      "c k",
      "s c",
      "e q",
      "a st",
      "s e",
      "wide hat",
      "ri p",
      "sc rip",
      "r e",
      "ta n",
      "r c",
      "se t",
      "c i",
      "ci rc",
      "re l",
      "s ta",
      "sta ck",
      "stack rel",
      "sin h",
      "n eq",
      "cos h",
      "s tar",
      "o p",
      "scrip tstyle",
      "u s",
      "tex tstyle",
      "m p",
      "Big g",
      "n ot",
      "var theta",
      "Big r",
      "Big l",
      "bigg r",
      "bigg l",
      "bold math",
      "l us",
      "op lus",
      "ng rightarrow",
      "f o",
      "b rac",
      "tex t",
      "f ra",
      "math fra",
      "mathfra k",
      "s f",
      "lo ngrightarrow",
      "ra ll",
      "fo rall",
      "su b",
      "sub set",
      "big l",
      "big r",
      "p to",
      "pro pto",
      "o int",
      "par row",
      "u parrow",
      "l le",
      "p s",
      "ma ps",
      "maps to",
      "d dot",
      "a ngle",
      "o m",
      "left rightarrow",
      "n o",
      "c u",
      "b in",
      "bin om",
      "v dots",
      "X i",
      "t ri",
      "tri angle",
      "r brac",
      "m be",
      "nu mbe",
      "no numbe",
      "nonumbe r",
      "math sf",
      "cu p",
      "b ot",
      "o r",
      "ar c",
      "i t",
      "R igh",
      "Righ tarrow",
      "f lo",
      "flo or",
      "ove r",
      "c ot",
      "c e",
      "co ng",
      "c ap",
      "text rm",
      "- -",
      "rbrac e",
      "ra lle",
      "pa ralle",
      "paralle l",
      "n e",
      "i math",
      "var rho",
      "t scriptstyle",
      "scrip tscriptstyle",
      "l brac",
      "h e",
      "s h",
      "arc tan",
      "c he",
      "che ck",
      "ow n",
      "ar row",
      "d own",
      "c frac",
      "b u",
      "text bf",
      "subset eq",
      "n to",
      "pha nto",
      "phanto m",
      "down arrow",
      "o d",
      "s la",
      "i o",
      "io ta",
      "g g",
      "la nd",
      "lle t",
      "bu llet",
      "over rightarrow",
      "d dots",
      "Bigg l",
      "t in",
      "tin y",
      "Bigg r",
      "U psilon",
      "lbrac k",
      "r floor",
      "e xi",
      "st s",
      "exi sts",
      "co lon",
      "in us",
      "I m",
      "unde rbrace",
      "sla sh",
      "l floor",
      "j math",
      "ve e",
      "f tarrow",
      "R e",
      "at op",
      "V e",
      "L o",
      "math it",
      "ne g",
      "le ftarrow",
      "w p",
      "Ve rt",
      "s ma",
      "m inus",
      "set minus",
      "sma ll",
      "di m",
      "i int",
      "su p",
      "big oplus",
      "big cup",
      "i l",
      "sup set",
      "ng leftrightarrow",
      "co th",
      "k e",
      "lo r",
      "m od",
      "se c",
      "L e",
      "pm od",
      "ft rightarrow",
      "Le ftrightarrow",
      "h line",
      "rbrac k",
      "u psilon",
      "b mod",
      "\\ #",
      "ar ge",
      "e ph",
      "al eph",
      "mi t",
      "Lo ngrightarrow",
      "b re",
      "o dot",
      "big wedge",
      "lbrac e",
      "bre ve",
      "arc sin",
      "ke r",
      "ar p",
      "c sc",
      "z e",
      "si ze",
      "- >",
      "over set",
      "la p",
      "var pi",
      "e mp",
      "t y",
      "emp ty",
      "empty set",
      "ot not",
      "fo otnot",
      "footnot e",
      "l i",
      "footnote size",
      "t e",
      "text sf",
      "a cu",
      "acu te",
      "f f",
      "i ff",
      "n t",
      "s b",
      "u p",
      "lo ngleftrightarrow",
      "ar g",
      "da sh",
      "ln ot",
      "de g",
      "unde r",
      "big triangle",
      "under set",
      "o o",
      "arp oo",
      "sla nt",
      "B o",
      "t t",
      "v phantom",
      "Bo x",
      "th arpoo",
      "r lap",
      "i iint",
      "var sigma",
      "Lo ngleftrightarrow",
      "e s",
      "i mp",
      "li es",
      "imp lies",
      "h f",
      "L arge",
      "a ck",
      "b ack",
      "back slash",
      "l ce",
      "lce il",
      "e il",
      "rc eil",
      "l arge",
      "math op",
      "righ tharpoo",
      "v dash",
      "to p",
      "big cap",
      "x rightarrow",
      "e c",
      "nu p",
      "rightharpoo nup",
      "i ll",
      "ove rbrace",
      "big otimes",
      "\\ ^",
      "r u",
      "dot eq",
      "st ru",
      "ker n",
      "hf ill",
      "stru t",
      "bigtriangle up",
      "leq slant",
      "over leftarrow",
      "i p",
      "k ip",
      "s kip",
      "om inus",
      "o nd",
      "am ond",
      "triangle q",
      "d dagger",
      "cdot p",
      "bo x",
      "nu ll",
      "th in",
      "pr ot",
      "var no",
      "thin g",
      "prot ec",
      "varno thing",
      "protec t",
      "n i",
      "big star",
      "di amond",
      "d iv",
      "\\ /",
      "sh arp",
      "f l",
      "fl at",
      "not in",
      "l lap",
      "r Vert",
      "lo ng",
      "var Delta",
      "long mapsto",
      "l Vert",
      "dots c",
      "` `",
      "k rightarrow",
      "o krightarrow",
      "ho okrightarrow",
      "ma ke",
      "bigtriangle down",
      "make box",
      "re f",
      "V dash",
      "supset eq",
      "big vee",
      "subset neq",
      "e n",
      "geq slant",
      "s l",
      "dots b",
      "li m",
      "en skip",
      "text up",
      "triangle left",
      "ma l",
      "sq cup",
      "r mal",
      "no rmal",
      "m o",
      "mo de",
      "j lim",
      "l s",
      "o u",
      "s pa",
      "v line",
      "mode ls",
      "spa ce",
      "d rel",
      "e r",
      "r d",
      "su rd",
      "la be",
      "bu il",
      "labe l",
      "buil drel",
      "i se",
      "ra ise",
      "\\ -",
      "p ou",
      "nd s",
      "pou nds",
      "\\ &",
      "s qu",
      "-- -",
      "Ve c",
      "n s",
      "ar e",
      "squ are",
      "f tharpoo",
      "le ftharpoo",
      "math rel",
      "right leftharpoo",
      "var Omega",
      "small setminus",
      "hf il",
      "rightleftharpoo ns",
      "f box",
      "s mi",
      "math or",
      "se arrow",
      "smi le",
      "mathor d",
      "c c",
      "ngle ftarrow",
      "su cc",
      "small skip",
      "l g",
      "\\ *",
      "o slash",
      "r times",
      "ti t",
      "pr ec",
      "tex tit",
      "text tt",
      "big m",
      "triangle right",
      "normal size",
      "s s",
      "int er",
      "lo ngleftarrow",
      "inter cal",
      "D own",
      "f row",
      "ra l",
      "ne arrow",
      "Down arrow",
      "frow n",
      "m pe",
      "n at",
      "u ral",
      "var pro",
      "bu mpe",
      "nat ural",
      "varpro jlim",
      "bumpe q",
      "S S",
      "e re",
      "o he",
      "t w",
      "le me",
      "th ere",
      "in jlim",
      "ad rightarrow",
      "var injlim",
      "co mp",
      "fo re",
      "over leftrightarrow",
      "ohe adrightarrow",
      "tw oheadrightarrow",
      "leme nt",
      "there fore",
      "comp lement",
      "c a",
      "th i",
      "n ce",
      "ig n",
      "al ign",
      "math strut",
      "su it",
      "big circ",
      "diamond suit",
      "ca nce",
      "thi ck",
      "cance l",
      "U parrow",
      "d skip",
      "h phantom",
      "me dskip",
      "A R",
      "G E",
      "L AR",
      "b ow",
      "g t",
      "r o",
      "le ss",
      "math tt",
      "ti e",
      "big sqcup",
      "Bigg m",
      "thick sim",
      "LAR GE",
      "bow tie",
      "less sim",
      "l lde",
      "w arrow",
      "nu llde",
      "no align",
      "sma sh",
      "mit er",
      "li miter",
      "nullde limiter",
      "nulldelimiter space",
      "A A",
      "D a",
      "v Da",
      "bar wedge",
      "be th",
      "eq no",
      "ro up",
      "vDa sh",
      "5 in",
      "D i",
      "t s",
      "nd own",
      "ge ts",
      "co prod",
      "dots m",
      "text normal",
      "rightharpoo ndown",
      "Di amond",
      "m m",
      "n rightarrow",
      "n leftrightarrow",
      "r sim",
      "r ne",
      "s warrow",
      "math c",
      "sq cap",
      "la x",
      "co rne",
      "Big m",
      "re lax",
      "prec eq",
      "gt rsim",
      "corne r",
      "math ope",
      "lo se",
      "var kappa",
      "ci te",
      "mathc lose",
      "mathope n",
      ") =",
      "B ar",
      "T i",
      "a sym",
      "d o",
      "g ra",
      "l r",
      "l se",
      "u ge",
      "x leftarrow",
      "math normal",
      "right rightarrow",
      "right leftarrow",
      "lo we",
      "sq subseteq",
      "co lse",
      "succ eq",
      "Ti lde",
      "asym p",
      "gra ve",
      "lr corner",
      "rightrightarrow s",
      "rightleftarrow s",
      "lowe r",
      "colse p",
      "H at",
      "a k",
      "b le",
      "d ou",
      "g roup",
      "n right",
      "n leftarrow",
      "r k",
      "r group",
      "u ph",
      "w bre",
      "al lo",
      "si de",
      "ho m",
      "big odot",
      "arpoo nright",
      "lg roup",
      "ble barwedge",
      "dou blebarwedge",
      "uph arpoonright",
      "wbre ak",
      "allo wbreak",
      "side set",
      "H uge",
      "a mal",
      "c m",
      "h skip",
      "l q",
      "p prox",
      "s ke",
      "ra pprox",
      "array colsep",
      "ve r",
      "su re",
      "var lim",
      "pm b",
      "sub stack",
      "leftrightarrow s",
      "Lo ngleftarrow",
      "supset neq",
      "up downarrow",
      "en sure",
      "gt rapprox",
      "amal g",
      "ske w",
      "ensure math",
      "c h",
      "c rc",
      "d ig",
      "d dag",
      "e m",
      "g ime",
      "j o",
      "l times",
      "n leq",
      "n warrow",
      "t ch",
      "ma rk",
      "ta g",
      "le d",
      "th de",
      "in rel",
      "left eq",
      "co un",
      "wi thde",
      "mathb in",
      "set coun",
      "circ led",
      "oint op",
      "no tag",
      "small int",
      "footnote mark",
      "te r",
      "oo align",
      "protect u",
      "lim s",
      "ver b",
      "crc r",
      "dig amma",
      "gime l",
      "jo inrel",
      "lefteq n",
      "withde lims",
      "setcoun ter",
      "1 p",
      "A r",
      "R rightarrow",
      "\\ '",
      "a e",
      "a g",
      "a pe",
      "b colsep",
      "f ill",
      "h uge",
      "m kern",
      "m skip",
      "w line",
      "ta bcolsep",
      "in f",
      "in de",
      "pi tch",
      "dot si",
      "int op",
      "row vert",
      "rightarrow fill",
      "ll corner",
      "bla ck",
      "leq q",
      "bigg m",
      "approx eq",
      "di ag",
      "sc sh",
      "fo rk",
      "brac e",
      "text sc",
      "text sl",
      "text circled",
      "cu r",
      "ne wline",
      "atop withdelims",
      "neg thick",
      "Le ftarrow",
      "up lus",
      "subsetneq q",
      "varlim sup",
      "varlim inf",
      "1p t",
      "Ar rowvert",
      "pitch fork",
      "black square",
      "diag up",
      "scsh ape",
      "negthick space",
      ") }",
      "1 mm",
      "1 cm",
      "2 0",
      "2 in",
      "3 mm",
      "5 cm",
      "6 cm",
      "7 mm",
      "8 cm",
      "D K",
      "T r",
      "a c",
      "a ve",
      "c kap",
      "d ddot",
      "e d",
      "e rline",
      "e ver",
      "i j",
      "i ce",
      "l y",
      "m d",
      "n da",
      "n nu",
      "n mid",
      "n Rightarrow",
      "n Vdash",
      "o f",
      "o ff",
      "s ho",
      "s pe",
      "v mode",
      "w r",
      "y math",
      "{ \\",
      "} +",
      "ma nnu",
      "ig arrow",
      "le ave",
      "ft er",
      "me ral",
      "math ac",
      "left rightharpoo",
      "right squ",
      "de f",
      "par box",
      "\\; }",
      "array st",
      "ve arrow",
      "int erline",
      "rt mid",
      "ng eq",
      "ho ice",
      "var Gamma",
      "var propto",
      "var triangle",
      "var Upsilon",
      "big uplus",
      "pa nda",
      "ex panda",
      "per ca",
      "re tch",
      "ci al",
      "not k",
      "brac k",
      "text md",
      "no inde",
      "over withdelims",
      "ce nt",
      "own s",
      "vee bar",
      "up perca",
      "under bar",
      "under rightarrow",
      "back simeq",
      "box times",
      "box ed",
      "protec te",
      "protect E",
      "protect Z",
      "protect m",
      "triangleleft eq",
      "prec cur",
      "thi ckap",
      "ro ot",
      "ro mannu",
      "mathc hoice",
      "em ph",
      "circled circ",
      "inde x",
      "cur vearrow",
      ")} }",
      "ever ymath",
      "ly eq",
      "off interline",
      "sho rtmid",
      "spe cial",
      "leave vmode",
      "mathac cent",
      "leftrightharpoo ns",
      "rightsqu igarrow",
      "arrayst retch",
      "expanda fter",
      "noinde nt",
      "upperca se",
      "preccur lyeq",
      "thickap prox",
      "romannu meral",
      "curvearrow right",
      "offinterline skip"
    ]
  }
}